--TEST--
Test for lowercasing latin filter
--FILE--
<?php
$filters = array(
	'latin_lowercase'
);
$string = file_get_contents(__DIR__.'/latin-lowercase.txt');
echo transliterate($string, $filters, 'utf-8', 'utf-8');
?>
--EXPECT--
diacritical remove:

latin-1 supplement
àáâãäå çèéêëìíîïðñòóôõö øùúûüý  
àáâãäå çèéêëìíîïðñòóôõö øùúûüý ÿ

latin extended-a
āāăăąąććĉĉċċččďďđđēēĕĕėėęęěěĝĝğğ
ġġģģĥĥħħĩĩīīĭĭįįıı  ĵĵķķĸĺĺļļľľŀ
ŀłłńńņņňňŉŋŋōōŏŏőő  ŕŕŗŗřřśśŝŝşş
ššţţťťŧŧũũūūŭŭůůűűųųŵŵŷŷŸźźżżžžſ

latin extended additional
ḁḁḃḃḅḅḇḇḉḉḋḋḍḍḏḏḑḑḓḓḕḕḗḗḙḙḛḛḝḝḟḟ
ḡḡḣḣḥḥḧḧḩḩḫḫḭḭḯḯḱḱḳḳḵḵḷḷḹḹḻḻḽḽḿḿ
ṁṁṃṃṅṅṇṇṉṉṋṋṍṍṏṏṑṑṓṓṕṕṗṗṙṙṛṛṝṝṟṟ
ṡṡṣṣṥṥṧṧṩṩṫṫṭṭṯṯṱṱṳṳṵṵṷṷṹṹṻṻṽṽṿṿ
ẁẁẃẃẅẅẇẇẉẉẋẋẍẍẏẏẑẑẓẓẕẕẖẗẘẙẚẛ

ạạảảấấầầẩẩẫẫậậắắằằẳẳẵẵặặẹẹẻẻẽẽếế
ềềểểễễệệỉỉịịọọỏỏốốồồổổỗỗộộớớờờởở
ỡỡợợụụủủứứừừửửữữựựỳỳỵỵỷỷỹỹ

------------------------------------------------------------------------------
normalize ligature:

latin-1 supplement
äåæöøüß äåæöøü

latin extended-a
ĳĳœœ

latin extended-b
ǄǅǆǇǈǉǊǋǌ ǣǣǱǲǳǽǽǿǿ
------------------------------------------------------------------------------
